In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [4]:
%%sql
select * from test.spending

 * mysql+mysqlconnector://tushar:***@localhost
6 rows affected.

   user_id  spend_date platform  amount
0        1  2019-07-01   mobile     100
1        1  2019-07-01  desktop     100
2        2  2019-07-01   mobile     100
3        2  2019-07-02   mobile     100
4        3  2019-07-01  desktop     100
5        3  2019-07-02  desktop     100

In [11]:
%%sql

with spending_analysis as (
select user_id, spend_date,max(platform) as platform, sum(amount) as total_amount
from test.spending group by user_id, spend_date
having count(distinct platform)=1
union all
select user_id, spend_date,'both' as platform, sum(amount) as total_amount
from test.spending group by user_id, spend_date
having count(distinct platform)=2)

select spend_date, platform, total_amount
from spending_analysis

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.

   spend_date platform total_amount
0  2019-07-01   mobile          100
1  2019-07-02   mobile          100
2  2019-07-01  desktop          100
3  2019-07-02  desktop          100
4  2019-07-01     both          200